STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/*
 * @brief  (HDP)
 */
typedef struct
{
  __IO uint32_t CTRL;            /*!< HDP control register                      Address offset: 0x000 */
  __IO uint32_t MUX;             /*!< HDP multiplexer control register          Address offset: 0x004 */
       uint32_t RESERVED0[2];    /*!< Reserved                                  Address offset: 0x008-0x00C */
  __IO uint32_t VAL;             /*!< HDP read back value register              Address offset: 0x010 */
  __IO uint32_t GPOSET;          /*!< HDP general purpose output set register   Address offset: 0x014 */
  __IO uint32_t GPOCLR;          /*!< HDP general purpose output clear register Address offset: 0x018 */
  __IO uint32_t GPOVAL;          /*!< HDP general purpose output value register Address offset: 0x01C */
       uint32_t RESERVED1[245];  /*!< Reserved                                  Address offset: 0x020-0x3F0 */
  __IO uint32_t VERR;            /*!< HDP version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< HDP identification register               Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< HDP size identification register          Address offset: 0x3FC */
} HDP_TypeDef;

/*
 * @brief HW Semaphore (HSEM)
 */
typedef struct
{
  __IO uint32_t R[16];           /*!< HSEM register                                    Address offset: 0x000-0x03C */
       uint32_t RESERVED0[16];   /*!< Reserved                                         Address offset: 0x040-0x07C */
  __IO uint32_t RLR[16];         /*!< HSEM read lock register                          Address offset: 0x080-0x0BC */
       uint32_t RESERVED1[16];   /*!< Reserved                                         Address offset: 0x0C0-0x0FC */
  __IO uint32_t C1IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x100 */
  __IO uint32_t C1ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x104 */
  __IO uint32_t C1ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x108 */
  __IO uint32_t C1MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x10C */
  __IO uint32_t C2IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x110 */
  __IO uint32_t C2ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x114 */
  __IO uint32_t C2ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x118 */
  __IO uint32_t C2MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x11C */
  __IO uint32_t C3IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x120 */
  __IO uint32_t C3ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x124 */
  __IO uint32_t C3ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x128 */
  __IO uint32_t C3MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x12C */
       uint32_t RESERVED2[20];   /*!< Reserved                                         Address offset: 0x130-0x17C */
  __IO uint32_t SC1IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x180 */
  __IO uint32_t SC1ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x184 */
  __IO uint32_t SC1ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x188 */
  __IO uint32_t SC1MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x18C */
  __IO uint32_t SC2IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x190 */
  __IO uint32_t SC2ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x194 */
  __IO uint32_t SC2ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x198 */
  __IO uint32_t SC2MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x19C */
  __IO uint32_t SC3IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x1A0 */
  __IO uint32_t SC3ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x1A4 */
  __IO uint32_t SC3ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x1A8 */
  __IO uint32_t SC3MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x1AC */
       uint32_t RESERVED3[20];   /*!< Reserved                                         Address offset: 0x1B0-0x1FC */
  __IO uint32_t SECCFGR;         /*!< HSEM Security configuration register             Address offset: 0x200 */
       uint32_t RESERVED4[3];    /*!< Reserved                                         Address offset: 0x204-0x20C */
  __IO uint32_t PRIVCFGR;        /*!< HSEM Privilege configuration register            Address offset: 0x210 */
       uint32_t RESERVED5[3];    /*!< Reserved                                         Address offset: 0x214-0x21C */
  __IO uint32_t C1CIDCFGR;       /*!< HSEM processor 1 CID configuration register      Address offset: 0x220 */
  __IO uint32_t C2CIDCFGR;       /*!< HSEM processor 2 CID configuration register      Address offset: 0x224 */
  __IO uint32_t C3CIDCFGR;       /*!< HSEM processor 3 CID configuration register      Address offset: 0x228 */
       uint32_t RESERVED6;       /*!< Reserved                                         Address offset: 0x22C */
  __IO uint32_t CR;              /*!< HSEM Clear register                              Address offset: 0x230 */
  __IO uint32_t KEYR;            /*!< HSEM clear key register                          Address offset: 0x234 */
       uint32_t RESERVED7[2];    /*!< Reserved                                         Address offset: 0x238-0x23C */
  __IO uint32_t G0CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x240 */
  __IO uint32_t G1CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x244 */
  __IO uint32_t G2CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x248 */
  __IO uint32_t G3CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x24C */
       uint32_t RESERVED8[103];  /*!< Reserved                                         Address offset: 0x250-0x3E8 */
  __I  uint32_t HWCFGR2;         /*!< HSEM hardware configuration register 2           Address offset: 0x3EC */
  __I  uint32_t HWCFGR1;         /*!< HSEM hardware configuration register 1           Address offset: 0x3F0 */
  __I  uint32_t VERR;            /*!< HSEM IP version register                         Address offset: 0x3F4 */
  __I  uint32_t IPIDR;           /*!< HSEM IP identification register                  Address offset: 0x3F8 */
  __I  uint32_t SIDR;            /*!< HSEM size identification register                Address offset: 0x3FC */
} HSEM_TypeDef;

typedef struct
{
  __IO uint32_t IER;             /*!< HSEM Interrupt enable register                   Address offset: 0x000 */
  __IO uint32_t ICR;             /*!< HSEM Interrupt clear register                    Address offset: 0x004 */
  __IO uint32_t ISR;             /*!< HSEM Interrupt status register                   Address offset: 0x008 */
  __IO uint32_t MISR;            /*!< HSEM Masked interrupt status register            Address offset: 0x00C */
} HSEM_Common_TypeDef;

