STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/*!< AHB4 peripherals Non secure aliases */
#define RCC_BASE_NS                         (AHB4_PERIPH_BASE_NS + 0x00000UL)
#define PWR_BASE_NS                         (AHB4_PERIPH_BASE_NS + 0x10000UL)
#define EXTI1_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x20000UL)
#define EXTI1_C1_BASE_NS                    (EXTI1_BASE_NS + 0x80UL)
#define EXTI1_C2_BASE_NS                    (EXTI1_BASE_NS + 0xC0UL)
#define EXTI1_C3_BASE_NS                    (EXTI1_BASE_NS + 0x100UL)
#define SYSCFG_BASE_NS                      (AHB4_PERIPH_BASE_NS + 0x30000UL)
#define GPIOA_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x40000UL)
#define GPIOB_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x50000UL)
#define GPIOC_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x60000UL)
#define GPIOD_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x70000UL)
#define GPIOE_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x80000UL)
#define GPIOF_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x90000UL)
#define GPIOG_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xA0000UL)
#define GPIOH_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xB0000UL)
#define GPIOI_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xC0000UL)
#define GPIOJ_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xD0000UL)
#define GPIOK_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xE0000UL)

/*!< SMART_RUN_APB peripherals Non secure aliases */
#define RTC_BASE_NS                         (SMART_RUN_APB_PERIPH_BASE_NS + 0x00000UL)
#define TAMP_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x10000UL)
#define SPI8_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x20000UL)
#define LPUART1_BASE_NS                     (SMART_RUN_APB_PERIPH_BASE_NS + 0x30000UL)
#define I2C8_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x40000UL)
#define LPTIM3_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x50000UL)
#define LPTIM4_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x60000UL)
#define LPTIM5_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x70000UL)
#define I3C4_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x80000UL)
#define IWDG5_BASE_NS                       (SMART_RUN_APB_PERIPH_BASE_NS + 0x90000UL)
#define WWDG2_BASE_NS                       (SMART_RUN_APB_PERIPH_BASE_NS + 0xA0000UL)

/*!< SMART_RUN_AHB peripherals Non secure aliases */
#define GPIOZ_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x00000UL)
#define LPDMA_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x10000UL)
#define ADF1_BASE_NS                        (SMART_RUN_AHB_PERIPH_BASE_NS + 0x20000UL)
#define ADF1_Filter0_BASE_NS                (ADF1_BASE_NS + 0x80UL)
#define EXTI2_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x30000UL)
#define EXTI2_C1_BASE_NS                    (EXTI2_BASE_NS + 0x80UL)
#define EXTI2_C2_BASE_NS                    (EXTI2_BASE_NS + 0xC0UL)
#define EXTI2_C3_BASE_NS                    (EXTI2_BASE_NS + 0x100UL)
#define HSEM_BASE_NS                        (SMART_RUN_AHB_PERIPH_BASE_NS + 0x40000UL)
#define IPCC2_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x50000UL)
#define IPCC2_C1_BASE_NS                    (IPCC2_BASE_NS)
#define IPCC2_C2_BASE_NS                    (IPCC2_BASE_NS + 0x10UL)

#define LPDMA_Channel0_BASE_NS              (LPDMA_BASE_NS + 0x0050UL)
#define LPDMA_Channel1_BASE_NS              (LPDMA_BASE_NS + 0x00D0UL)
#define LPDMA_Channel2_BASE_NS              (LPDMA_BASE_NS + 0x0150UL)
#define LPDMA_Channel3_BASE_NS              (LPDMA_BASE_NS + 0x01D0UL)

/*!< APB4 peripherals Non secure aliases */
#define LTDC_BASE_NS                        (APB4_PERIPH_BASE_NS + 0x10000UL)
#define LTDC_Layer1_BASE_NS                 (LTDC_BASE_NS + 0x100UL)
#define LTDC_Layer2_BASE_NS                 (LTDC_BASE_NS + 0x200UL)
#define LTDC_Layer3_BASE_NS                 (LTDC_BASE_NS + 0x300UL)

#define CSI_BASE_NS                         (APB4_PERIPH_BASE_NS + 0x20000UL)
#define DCMIPP_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x30000UL)
#define DDRC_BASE_NS                        (APB4_PERIPH_BASE_NS + 0x40000UL)
#define DDRDBG_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x50000UL)
#define DDRPERFM_BASE_NS                    (DDRC_BASE_NS + 0x1000UL)
#define STGENR_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x70000UL)
#define STGENC_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x80000UL)
#define GICV2M_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x90000UL)
#define UCPD1_BASE_NS                       (APB4_PERIPH_BASE_NS + 0xA0000UL)
#define BUSPERFM_BASE_NS                    (APB4_PERIPH_BASE_NS + 0xB0000UL)
#define USB3PCIEPHY_BASE_NS                 (APB4_PERIPH_BASE_NS + 0xC0000UL)

/*!< AHB5 peripherals Non secure aliases */
#define FMC_BASE_NS                         (AHB5_PERIPH_BASE_NS + 0x000000UL)
#define SDMMC1_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x020000UL)
#define SDMMC2_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x030000UL)
#define SDMMC3_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x040000UL)
#define ETH1_BASE_NS                        (AHB5_PERIPH_BASE_NS + 0x0C0000UL)
#define ETH2_BASE_NS                        (AHB5_PERIPH_BASE_NS + 0x0D0000UL)
#define USBH_OHCI_BASE_NS                   (AHB5_PERIPH_BASE_NS + 0x0E0000UL)
#define USBH_EHCI_BASE_NS                   (AHB5_PERIPH_BASE_NS + 0x0F0000UL)
#define USB3DRD_BASE_NS                     (AHB5_PERIPH_BASE_NS + 0x100000UL)
#define CA35SYSCFG_BASE_NS                  (AHB5_PERIPH_BASE_NS + 0x602000UL)
#define FMC_NAND_DATA_BASE_NS               (AHB5_PERIPH_BASE_NS + 0x610000UL)
#define DDRPHYC_BASE_NS                     (AHB5_PERIPH_BASE_NS + 0xA00000UL)

/*!< APB_DEBUG peripherals Non secure aliases */
#define DBGMCU_BASE_NS                      (APB_DEBUG_PERIPH_BASE_NS + 0x010000UL)

/*!< AHB6 peripherals Non secure aliases */
/*!< FMC Banks registers base address */
#define FMC_Bank1_R_BASE_NS                 (FMC_BASE_NS + 0x0000UL)
#define FMC_Bank1E_R_BASE_NS                (FMC_BASE_NS + 0x0104UL)
#define FMC_Bank3_R_BASE_NS                 (FMC_BASE_NS + 0x0080UL)
#define FMC_Common_R_BASE_NS                (FMC_BASE_NS + 0x0020UL)

#if defined (CORTEX_IN_SECURE_STATE)
/*!< Offset between Non-secure aliases and Secure aliases */
#define  OFFSET_NS_S                        (0x10000000UL)

