STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
#endif /* CORTEX_IN_SECURE_STATE */
/**
  * @}
  */
#define TIM2_NS                             ((TIM_TypeDef *) TIM2_BASE_NS)
#define TIM3_NS                             ((TIM_TypeDef *) TIM3_BASE_NS)
#define TIM4_NS                             ((TIM_TypeDef *) TIM4_BASE_NS)
#define TIM5_NS                             ((TIM_TypeDef *) TIM5_BASE_NS)
#define TIM6_NS                             ((TIM_TypeDef *) TIM6_BASE_NS)
#define TIM7_NS                             ((TIM_TypeDef *) TIM7_BASE_NS)
#define TIM12_NS                            ((TIM_TypeDef *) TIM12_BASE_NS)
#define TIM13_NS                            ((TIM_TypeDef *) TIM13_BASE_NS)
#define TIM14_NS                            ((TIM_TypeDef *) TIM14_BASE_NS)
#define LPTIM1_NS                           ((LPTIM_TypeDef *) LPTIM1_BASE_NS)
#define LPTIM2_NS                           ((LPTIM_TypeDef *) LPTIM2_BASE_NS)
#define SPI2_NS                             ((SPI_TypeDef *) SPI2_BASE_NS)
#define SPI3_NS                             ((SPI_TypeDef *) SPI3_BASE_NS)
#define SPDIFRX_NS                          ((SPDIFRX_TypeDef *) SPDIFRX_BASE_NS)
#define USART2_NS                           ((USART_TypeDef *) USART2_BASE_NS)
#define USART3_NS                           ((USART_TypeDef *) USART3_BASE_NS)
#define UART4_NS                            ((USART_TypeDef *) UART4_BASE_NS)
#define UART5_NS                            ((USART_TypeDef *) UART5_BASE_NS)
#define I2C1_NS                             ((I2C_TypeDef *) I2C1_BASE_NS)
#define I2C2_NS                             ((I2C_TypeDef *) I2C2_BASE_NS)
#define I2C3_NS                             ((I2C_TypeDef *) I2C3_BASE_NS)
#define I2C4_NS                             ((I2C_TypeDef *) I2C4_BASE_NS)
#define I2C5_NS                             ((I2C_TypeDef *) I2C5_BASE_NS)
#define I2C6_NS                             ((I2C_TypeDef *) I2C6_BASE_NS)
#define I2C7_NS                             ((I2C_TypeDef *) I2C7_BASE_NS)
#define I3C1_NS                             ((I3C_TypeDef *) I3C1_BASE_NS)
#define I3C2_NS                             ((I3C_TypeDef *) I3C2_BASE_NS)
#define I3C3_NS                             ((I3C_TypeDef *) I3C3_BASE_NS)
#define TIM10_NS                            ((TIM_TypeDef *) TIM10_BASE_NS)
#define TIM11_NS                            ((TIM_TypeDef *) TIM11_BASE_NS)

#define TIM1_NS                             ((TIM_TypeDef *) TIM1_BASE_NS)
#define TIM8_NS                             ((TIM_TypeDef *) TIM8_BASE_NS)
#define USART6_NS                           ((USART_TypeDef *) USART6_BASE_NS)
#define SPI1_NS                             ((SPI_TypeDef *) SPI1_BASE_NS)
#define SPI4_NS                             ((SPI_TypeDef *) SPI4_BASE_NS)
#define TIM15_NS                            ((TIM_TypeDef *) TIM15_BASE_NS)
#define TIM16_NS                            ((TIM_TypeDef *) TIM16_BASE_NS)
#define TIM17_NS                            ((TIM_TypeDef *) TIM17_BASE_NS)
#define SPI5_NS                             ((SPI_TypeDef *) SPI5_BASE_NS)
#define SAI1_NS                             ((SAI_TypeDef *) SAI1_BASE_NS)
#define SAI1_Block_A_NS                     ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_NS)
#define SAI1_Block_B_NS                     ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_NS)
#define SAI2_NS                             ((SAI_TypeDef *) SAI2_BASE_NS)
#define SAI2_Block_A_NS                     ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_NS)
#define SAI2_Block_B_NS                     ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_NS)
#define SAI3_NS                             ((SAI_TypeDef *) SAI3_BASE_NS)
#define SAI3_Block_A_NS                     ((SAI_Block_TypeDef *) SAI3_Block_A_BASE_NS)
#define SAI3_Block_B_NS                     ((SAI_Block_TypeDef *) SAI3_Block_B_BASE_NS)
#define UART9_NS                            ((USART_TypeDef *) UART9_BASE_NS)
#define FDCAN1_NS                           ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_NS)
#define FDCAN2_NS                           ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_NS)
#define FDCAN3_NS                           ((FDCAN_GlobalTypeDef *) FDCAN3_BASE_NS)
#define FDCAN_CCU_NS                        ((FDCAN_ClockCalibrationUnit_TypeDef *) CANCU_BASE_NS)
#define TIM20_NS                            ((TIM_TypeDef *) TIM20_BASE_NS)
#define USART1_NS                           ((USART_TypeDef *) USART1_BASE_NS)
#define SAI4_NS                             ((SAI_TypeDef *) SAI4_BASE_NS)
#define SAI4_Block_A_NS                     ((SAI_Block_TypeDef *) SAI4_Block_A_BASE_NS)
#define SAI4_Block_B_NS                     ((SAI_Block_TypeDef *) SAI4_Block_B_BASE_NS)
#define SPI6_NS                             ((SPI_TypeDef *) SPI6_BASE_NS)
#define SPI7_NS                             ((SPI_TypeDef *) SPI7_BASE_NS)
#define UART7_NS                            ((USART_TypeDef *) UART7_BASE_NS)
#define UART8_NS                            ((USART_TypeDef *) UART8_BASE_NS)

#define HPDMA1_NS                           ((DMA_TypeDef *) HPDMA1_BASE_NS)
#define HPDMA2_NS                           ((DMA_TypeDef *) HPDMA2_BASE_NS)
#define HPDMA3_NS                           ((DMA_TypeDef *) HPDMA3_BASE_NS)
#define OCTOSPI1_NS                         ((OCTOSPI_TypeDef *) OCTOSPI1_BASE_NS)
#define OCTOSPI2_NS                         ((OCTOSPI_TypeDef *) OCTOSPI2_BASE_NS)
#define OTFDEC1_NS                          ((OTFDEC_TypeDef *) OTFDEC1_BASE_NS)
#define OTFDEC1_REGION1_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION1_BASE_NS)
#define OTFDEC1_REGION2_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION2_BASE_NS)
#define OTFDEC1_REGION3_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION3_BASE_NS)
#define OTFDEC1_REGION4_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION4_BASE_NS)
#define OTFDEC2_NS                          ((OTFDEC_TypeDef *) OTFDEC2_BASE_NS)
#define OTFDEC2_REGION1_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION1_BASE_NS)
#define OTFDEC2_REGION2_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION2_BASE_NS)
#define OTFDEC2_REGION3_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION3_BASE_NS)
#define OTFDEC2_REGION4_NS                  ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION4_BASE_NS)
#define ICACHE_NS                           ((ICACHE_TypeDef *) ICACHE_BASE_NS)
#define DCACHE_NS                           ((DCACHE_TypeDef *) DCACHE_BASE_NS)
#define IPCC1_NS                            ((IPCC_TypeDef *) IPCC1_BASE_NS)
#define IPCC1_C1_NS                         ((IPCC_CommonTypeDef *) IPCC1_C1_BASE_NS)
#define IPCC1_C2_NS                         ((IPCC_CommonTypeDef *) IPCC1_C2_BASE_NS)
#define DCMI_NS                             ((DCMI_TypeDef *) DCMI_BASE_NS)
#define PSSI_NS                             ((PSSI_TypeDef *) PSSI_BASE_NS)
#define CRC_NS                              ((CRC_TypeDef *) CRC_BASE_NS)
#define MDF1_NS                             ((MDF_TypeDef *) MDF1_BASE_NS)
#define MDF1_Filter0_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter0_BASE_NS)
#define MDF1_Filter1_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter1_BASE_NS)
#define MDF1_Filter2_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter2_BASE_NS)
#define MDF1_Filter3_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter3_BASE_NS)
#define MDF1_Filter4_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter4_BASE_NS)
#define MDF1_Filter5_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter5_BASE_NS)
#define MDF1_Filter6_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter6_BASE_NS)
#define MDF1_Filter7_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter7_BASE_NS)
#define ADC1_NS                             ((ADC_TypeDef *) ADC1_BASE_NS)
#define ADC2_NS                             ((ADC_TypeDef *) ADC2_BASE_NS)
#define ADC12_COMMON_NS                     ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_NS)
#define ADC3_NS                             ((ADC_TypeDef *) ADC3_BASE_NS)
#define ADC3_COMMON_NS                      ((ADC_Common_TypeDef *) ADC3_COMMON_BASE_NS)
#define OCTOSPIM_NS                         ((OCTOSPIM_TypeDef *) OCTOSPIM_BASE_NS)

