STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
#define HPDMA2_Channel6             HPDMA2_Channel6_NS
#define HPDMA2_Channel6_BASE        HPDMA2_Channel6_BASE_NS

#define HPDMA2_Channel7             HPDMA2_Channel7_NS
#define HPDMA2_Channel7_BASE        HPDMA2_Channel7_BASE_NS

#define HPDMA2_Channel8             HPDMA2_Channel8_NS
#define HPDMA2_Channel8_BASE        HPDMA2_Channel8_BASE_NS

#define HPDMA2_Channel9             HPDMA2_Channel9_NS
#define HPDMA2_Channel9_BASE        HPDMA2_Channel9_BASE_NS

#define HPDMA2_Channel10            HPDMA2_Channel10_NS
#define HPDMA2_Channel10_BASE       HPDMA2_Channel10_BASE_NS

#define HPDMA2_Channel11            HPDMA2_Channel11_NS
#define HPDMA2_Channel11_BASE       HPDMA2_Channel11_BASE_NS

#define HPDMA2_Channel12            HPDMA2_Channel12_NS
#define HPDMA2_Channel12_BASE       HPDMA2_Channel12_BASE_NS

#define HPDMA2_Channel13            HPDMA2_Channel13_NS
#define HPDMA2_Channel13_BASE       HPDMA2_Channel13_BASE_NS

#define HPDMA2_Channel14            HPDMA2_Channel14_NS
#define HPDMA2_Channel14_BASE       HPDMA2_Channel14_BASE_NS

#define HPDMA2_Channel15            HPDMA2_Channel15_NS
#define HPDMA2_Channel15_BASE       HPDMA2_Channel15_BASE_NS

#define HPDMA3_Channel0             HPDMA3_Channel0_NS
#define HPDMA3_Channel0_BASE        HPDMA3_Channel0_BASE_NS

#define HPDMA3_Channel1             HPDMA3_Channel1_NS
#define HPDMA3_Channel1_BASE        HPDMA3_Channel1_BASE_NS

#define HPDMA3_Channel2             HPDMA3_Channel2_NS
#define HPDMA3_Channel2_BASE        HPDMA3_Channel2_BASE_NS

#define HPDMA3_Channel3             HPDMA3_Channel3_NS
#define HPDMA3_Channel3_BASE        HPDMA3_Channel3_BASE_NS

#define HPDMA3_Channel4             HPDMA3_Channel4_NS
#define HPDMA3_Channel4_BASE        HPDMA3_Channel4_BASE_NS

#define HPDMA3_Channel5             HPDMA3_Channel5_NS
#define HPDMA3_Channel5_BASE        HPDMA3_Channel5_BASE_NS

#define HPDMA3_Channel6             HPDMA3_Channel6_NS
#define HPDMA3_Channel6_BASE        HPDMA3_Channel6_BASE_NS

#define HPDMA3_Channel7             HPDMA3_Channel7_NS
#define HPDMA3_Channel7_BASE        HPDMA3_Channel7_BASE_NS

#define HPDMA3_Channel8             HPDMA3_Channel8_NS
#define HPDMA3_Channel8_BASE        HPDMA3_Channel8_BASE_NS

#define HPDMA3_Channel9             HPDMA3_Channel9_NS
#define HPDMA3_Channel9_BASE        HPDMA3_Channel9_BASE_NS

#define HPDMA3_Channel10            HPDMA3_Channel10_NS
#define HPDMA3_Channel10_BASE       HPDMA3_Channel10_BASE_NS

#define HPDMA3_Channel11            HPDMA3_Channel11_NS
#define HPDMA3_Channel11_BASE       HPDMA3_Channel11_BASE_NS

#define HPDMA3_Channel12            HPDMA3_Channel12_NS
#define HPDMA3_Channel12_BASE       HPDMA3_Channel12_BASE_NS

#define HPDMA3_Channel13            HPDMA3_Channel13_NS
#define HPDMA3_Channel13_BASE       HPDMA3_Channel13_BASE_NS

#define HPDMA3_Channel14            HPDMA3_Channel14_NS
#define HPDMA3_Channel14_BASE       HPDMA3_Channel14_BASE_NS

#define HPDMA3_Channel15            HPDMA3_Channel15_NS
#define HPDMA3_Channel15_BASE       HPDMA3_Channel15_BASE_NS

/*!< AHB3 peripherals defaults to Non secure aliases */
#define HASH                        HASH_NS
#define HASH_BASE                   HASH_BASE_NS

#define HASH_DIGEST                 HASH_DIGEST_NS
#define HASH_DIGEST_BASE            HASH_DIGEST_BASE_NS

#define RNG                         RNG_NS
#define RNG_BASE                    RNG_BASE_NS

#define CRYP1                       CRYP1_NS
#define CRYP1_BASE                  CRYP1_BASE_NS

#define CRYP2                       CRYP2_NS
#define CRYP2_BASE                  CRYP2_BASE_NS

#define SAES                        SAES_NS
#define SAES_BASE                   SAES_BASE_NS

#define PKA                         PKA_NS
#define PKA_BASE                    PKA_BASE_NS

#define RAMCFG                      RAMCFG_NS
#define RAMCFG_BASE                 RAMCFG_BASE_NS

#define RAMCFG_SYSRAM               RAMCFG_SYSRAM_NS
#define RAMCFG_SYSRAM_BASE          RAMCFG_SYSRAM_BASE_NS

#define RAMCFG_SRAM1                RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE           RAMCFG_SRAM1_BASE_NS

#define RAMCFG_SRAM2                RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE           RAMCFG_SRAM2_BASE_NS

#define RAMCFG_RETRAM               RAMCFG_RETRAM_NS
#define RAMCFG_RETRAM_BASE          RAMCFG_RETRAM_BASE_NS

#define RAMCFG_LPSRAM1              RAMCFG_LPSRAM1_NS
#define RAMCFG_LPSRAM1_BASE         RAMCFG_LPSRAM1_BASE_NS

#define RAMCFG_LPSRAM2              RAMCFG_LPSRAM2_NS
#define RAMCFG_LPSRAM2_BASE         RAMCFG_LPSRAM2_BASE_NS

#define RAMCFG_LPSRAM3              RAMCFG_LPSRAM3_NS
#define RAMCFG_LPSRAM3_BASE         RAMCFG_LPSRAM3_BASE_NS

#define RAMCFG_BKPSRAM              RAMCFG_BKPSRAM_NS
#define RAMCFG_BKPSRAM_BASE         RAMCFG_BKPSRAM_BASE_NS

#define RAMCFG_VDERAM               RAMCFG_VDERAM_NS
#define RAMCFG_VDERAM_BASE          RAMCFG_VDERAM_BASE_NS

#define RIFSC                       RIFSC_NS
#define RIFSC_BASE                  RIFSC_BASE_NS

#define RISC                        RISC_NS
#define RISC_BASE                   RISC_BASE_NS

#define RIMC                        RIMC_NS
#define RIMC_BASE                   RIMC_BASE_NS

#define RIFSC_ID                    RIFSC_ID_NS
#define RIFSC_ID_BASE               RIFSC_ID_BASE_NS

#define IAC                         IAC_NS
#define IAC_BASE                    IAC_BASE_NS

#define RISAF1                      RISAF1_NS
#define RISAF1_BASE                 RISAF1_BASE_NS

#define RISAF2                      RISAF2_NS
#define RISAF2_BASE                 RISAF2_BASE_NS

#define RISAF4                      RISAF4_NS
#define RISAF4_BASE                 RISAF4_BASE_NS

#define RISAF5                      RISAF5_NS
#define RISAF5_BASE                 RISAF5_BASE_NS

#define RISAB1                      RISAB1_NS
#define RISAB1_BASE                 RISAB1_BASE_NS

#define RISAB2                      RISAB2_NS
#define RISAB2_BASE                 RISAB2_BASE_NS

#define RISAB3                      RISAB3_NS
#define RISAB3_BASE                 RISAB3_BASE_NS

#define RISAB4                      RISAB4_NS
#define RISAB4_BASE                 RISAB4_BASE_NS

#define RISAB5                      RISAB5_NS
#define RISAB5_BASE                 RISAB5_BASE_NS

#define RISAB6                      RISAB6_NS
#define RISAB6_BASE                 RISAB6_BASE_NS

/*!< APB3 peripherals defaults to Non secure aliases */
#define BSEC                        BSEC_NS
#define BSEC_BASE                   BSEC_BASE_NS

#define IWDG1                       IWDG1_NS
#define IWDG1_BASE                  IWDG1_BASE_NS

#define IWDG2                       IWDG2_NS
#define IWDG2_BASE                  IWDG2_BASE_NS

