STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/******************  Bit definition for LTDC_GC2R register  *******************/
#define LTDC_GC2R_BLA_Pos             (0U)
#define LTDC_GC2R_BLA_Msk             (0x1UL << LTDC_GC2R_BLA_Pos)/*!< 0x00000001 */
#define LTDC_GC2R_BLA                 LTDC_GC2R_BLA_Msk          /*!< background layer ability (pixels of background layer are read from memory) */
#define LTDC_GC2R_STSA_Pos            (1U)
#define LTDC_GC2R_STSA_Msk            (0x1UL << LTDC_GC2R_STSA_Pos) /*!< 0x00000002 */
#define LTDC_GC2R_STSA                LTDC_GC2R_STSA_Msk         /*!< slave timings synchronization ability */
#define LTDC_GC2R_DVA_Pos             (2U)
#define LTDC_GC2R_DVA_Msk             (0x1UL << LTDC_GC2R_DVA_Pos)/*!< 0x00000004 */
#define LTDC_GC2R_DVA                 LTDC_GC2R_DVA_Msk          /*!< dual-view ability */
#define LTDC_GC2R_DPA_Pos             (3U)
#define LTDC_GC2R_DPA_Msk             (0x1UL << LTDC_GC2R_DPA_Pos)/*!< 0x00000008 */
#define LTDC_GC2R_DPA                 LTDC_GC2R_DPA_Msk          /*!< secondary RGB output port ability */
#define LTDC_GC2R_BW_Pos              (4U)
#define LTDC_GC2R_BW_Msk              (0x7UL << LTDC_GC2R_BW_Pos) /*!< 0x00000070 */
#define LTDC_GC2R_BW                  LTDC_GC2R_BW_Msk           /*!< bus width (log2 of number of bytes) */
#define LTDC_GC2R_EDCA_Pos            (7U)
#define LTDC_GC2R_EDCA_Msk            (0x1UL << LTDC_GC2R_EDCA_Pos) /*!< 0x00000080 */
#define LTDC_GC2R_EDCA                LTDC_GC2R_EDCA_Msk         /*!< external display control ability */
#define LTDC_GC2R_OCA_Pos             (8U)
#define LTDC_GC2R_OCA_Msk             (0x1UL << LTDC_GC2R_OCA_Pos)/*!< 0x00000100 */
#define LTDC_GC2R_OCA                 LTDC_GC2R_OCA_Msk          /*!< output conversion ability (RGB to YCbCr) */
#define LTDC_GC2R_AXIIDA_Pos          (9U)
#define LTDC_GC2R_AXIIDA_Msk          (0x1UL << LTDC_GC2R_AXIIDA_Pos)   /*!< 0x00000200 */
#define LTDC_GC2R_AXIIDA              LTDC_GC2R_AXIIDA_Msk       /*!< AXIID ability */
#define LTDC_GC2R_ROTA_Pos            (10U)
#define LTDC_GC2R_ROTA_Msk            (0x1UL << LTDC_GC2R_ROTA_Pos) /*!< 0x00000400 */
#define LTDC_GC2R_ROTA                LTDC_GC2R_ROTA_Msk         /*!< rotation support ability */
#define LTDC_GC2R_SISA_Pos            (11U)
#define LTDC_GC2R_SISA_Msk            (0x1UL << LTDC_GC2R_SISA_Pos) /*!< 0x00000800 */
#define LTDC_GC2R_SISA                LTDC_GC2R_SISA_Msk         /*!< second interrupt set ability */
#define LTDC_GC2R_SFA_Pos             (12U)
#define LTDC_GC2R_SFA_Msk             (0x1UL << LTDC_GC2R_SFA_Pos)/*!< 0x00001000 */
#define LTDC_GC2R_SFA                 LTDC_GC2R_SFA_Msk          /*!< single frame mode ability */
#define LTDC_GC2R_CRCA_Pos            (13U)
#define LTDC_GC2R_CRCA_Msk            (0x1UL << LTDC_GC2R_CRCA_Pos) /*!< 0x00002000 */
#define LTDC_GC2R_CRCA                LTDC_GC2R_CRCA_Msk         /*!< CRC ability */
#define LTDC_GC2R_BOA_Pos             (15U)
#define LTDC_GC2R_BOA_Msk             (0x1UL << LTDC_GC2R_BOA_Pos)/*!< 0x00008000 */
#define LTDC_GC2R_BOA                 LTDC_GC2R_BOA_Msk          /*!< blending order ability */

/******************  Bit definition for LTDC_SRCR register  *******************/
#define LTDC_SRCR_IMR_Pos             (0U)
#define LTDC_SRCR_IMR_Msk             (0x1UL << LTDC_SRCR_IMR_Pos)/*!< 0x00000001 */
#define LTDC_SRCR_IMR                 LTDC_SRCR_IMR_Msk          /*!< immediate reload trigger */
#define LTDC_SRCR_VBR_Pos             (1U)
#define LTDC_SRCR_VBR_Msk             (0x1UL << LTDC_SRCR_VBR_Pos)/*!< 0x00000002 */
#define LTDC_SRCR_VBR                 LTDC_SRCR_VBR_Msk          /*!< vertical blanking reload request */

/******************  Bit definition for LTDC_GCCR register  *******************/
#define LTDC_GCCR_ADDR_Pos            (0U)
#define LTDC_GCCR_ADDR_Msk            (0xFFUL << LTDC_GCCR_ADDR_Pos)  /*!< 0x000000FF */
#define LTDC_GCCR_ADDR                LTDC_GCCR_ADDR_Msk         /*!< address of the R,G,B table where the COMP component is written */
#define LTDC_GCCR_COMP_Pos            (8U)
#define LTDC_GCCR_COMP_Msk            (0xFFUL << LTDC_GCCR_COMP_Pos)  /*!< 0x0000FF00 */
#define LTDC_GCCR_COMP                LTDC_GCCR_COMP_Msk         /*!< color component to be written, in either (or all) the R,G,B tables */
#define LTDC_GCCR_BEN_Pos             (16U)
#define LTDC_GCCR_BEN_Msk             (0x1UL << LTDC_GCCR_BEN_Pos)/*!< 0x00010000 */
#define LTDC_GCCR_BEN                 LTDC_GCCR_BEN_Msk          /*!< write trigger to the blue table */
#define LTDC_GCCR_GEN_Pos             (17U)
#define LTDC_GCCR_GEN_Msk             (0x1UL << LTDC_GCCR_GEN_Pos)/*!< 0x00020000 */
#define LTDC_GCCR_GEN                 LTDC_GCCR_GEN_Msk          /*!< write trigger to the green table */
#define LTDC_GCCR_REN_Pos             (18U)
#define LTDC_GCCR_REN_Msk             (0x1UL << LTDC_GCCR_REN_Pos)/*!< 0x00040000 */
#define LTDC_GCCR_REN                 LTDC_GCCR_REN_Msk          /*!< write trigger to the red table */

/******************  Bit definition for LTDC_BCCR register  *******************/
#define LTDC_BCCR_BCBLUE_Pos          (0U)
#define LTDC_BCCR_BCBLUE_Msk          (0xFFUL << LTDC_BCCR_BCBLUE_Pos)    /*!< 0x000000FF */
#define LTDC_BCCR_BCBLUE              LTDC_BCCR_BCBLUE_Msk       /*!< background color blue value */
#define LTDC_BCCR_BCGREEN_Pos         (8U)
#define LTDC_BCCR_BCGREEN_Msk         (0xFFUL << LTDC_BCCR_BCGREEN_Pos)     /*!< 0x0000FF00 */
#define LTDC_BCCR_BCGREEN             LTDC_BCCR_BCGREEN_Msk      /*!< background color green value */
#define LTDC_BCCR_BCRED_Pos           (16U)
#define LTDC_BCCR_BCRED_Msk           (0xFFUL << LTDC_BCCR_BCRED_Pos)   /*!< 0x00FF0000 */
#define LTDC_BCCR_BCRED               LTDC_BCCR_BCRED_Msk        /*!< background color red value */

/*******************  Bit definition for LTDC_IER register  *******************/
#define LTDC_IER_LIE_Pos              (0U)
#define LTDC_IER_LIE_Msk              (0x1UL << LTDC_IER_LIE_Pos) /*!< 0x00000001 */
#define LTDC_IER_LIE                  LTDC_IER_LIE_Msk           /*!< Line interrupt enable */
#define LTDC_IER_FUWIE_Pos            (1U)
#define LTDC_IER_FUWIE_Msk            (0x1UL << LTDC_IER_FUWIE_Pos) /*!< 0x00000002 */
#define LTDC_IER_FUWIE                LTDC_IER_FUWIE_Msk         /*!< FIFO underrun warning interrupt enable  */
#define LTDC_IER_TERRIE_Pos           (2U)
#define LTDC_IER_TERRIE_Msk           (0x1UL << LTDC_IER_TERRIE_Pos)  /*!< 0x00000004 */
#define LTDC_IER_TERRIE               LTDC_IER_TERRIE_Msk        /*!< Transfer Error interrupt enable */
#define LTDC_IER_RRIE_Pos             (3U)
#define LTDC_IER_RRIE_Msk             (0x1UL << LTDC_IER_RRIE_Pos)/*!< 0x00000008 */
#define LTDC_IER_RRIE                 LTDC_IER_RRIE_Msk          /*!< Register reload interrupt enable */
#define LTDC_IER_FUKIE_Pos            (6U)
#define LTDC_IER_FUKIE_Msk            (0x1UL << LTDC_IER_FUKIE_Pos)/*!< 0x00000040 */
#define LTDC_IER_FUKIE                LTDC_IER_FUKIE_Msk         /*!< FIFO underrun killing interrupt enable  */
#define LTDC_IER_CRCIE_Pos            (7U)
#define LTDC_IER_CRCIE_Msk            (0x1UL << LTDC_IER_CRCIE_Pos) /*!< 0x00000080 */
#define LTDC_IER_CRCIE                LTDC_IER_CRCIE_Msk         /*!< CRC error interrupt enable */
#define LTDC_IER_FURIE_Pos            (8U)
#define LTDC_IER_FURIE_Msk            (0x1UL << LTDC_IER_FURIE_Pos) /*!< 0x00000100 */
#define LTDC_IER_FURIE                LTDC_IER_FURIE_Msk         /*!< FIFO underrun error at rotation interrupt enable */

/*******************  Bit definition for LTDC_ISR register  *******************/
#define LTDC_ISR_LIF_Pos              (0U)
#define LTDC_ISR_LIF_Msk              (0x1UL << LTDC_ISR_LIF_Pos) /*!< 0x00000001 */
#define LTDC_ISR_LIF                  LTDC_ISR_LIF_Msk           /*!< Line interrupt flag */
#define LTDC_ISR_FUWIF_Pos            (1U)
#define LTDC_ISR_FUWIF_Msk            (0x1UL << LTDC_ISR_FUWIF_Pos) /*!< 0x00000002 */
#define LTDC_ISR_FUWIF                LTDC_ISR_FUWIF_Msk         /*!< FIFO underrun warning interrupt flag */
#define LTDC_ISR_TERRIF_Pos           (2U)
#define LTDC_ISR_TERRIF_Msk           (0x1UL << LTDC_ISR_TERRIF_Pos)  /*!< 0x00000004 */
#define LTDC_ISR_TERRIF               LTDC_ISR_TERRIF_Msk        /*!< Transfer error interrupt flag */
#define LTDC_ISR_RRIF_Pos             (3U)
#define LTDC_ISR_RRIF_Msk             (0x1UL << LTDC_ISR_RRIF_Pos)/*!< 0x00000008 */
#define LTDC_ISR_RRIF                 LTDC_ISR_RRIF_Msk          /*!< Register reload interrupt flag */
#define LTDC_ISR_FUKIF_Pos            (6U)
#define LTDC_ISR_FUKIF_Msk            (0x1UL << LTDC_ISR_FUKIF_Pos)/*!< 0x00000040 */
#define LTDC_ISR_FUKIF                LTDC_ISR_FUKIF_Msk         /*!< FIFO underrun killing interrupt flag */
#define LTDC_ISR_CRCIF_Pos            (7U)
#define LTDC_ISR_CRCIF_Msk            (0x1UL << LTDC_ISR_CRCIF_Pos) /*!< 0x00000080 */
#define LTDC_ISR_CRCIF                LTDC_ISR_CRCIF_Msk         /*!< CRC error interrupt flag */
#define LTDC_ISR_FURIF_Pos            (8U)
#define LTDC_ISR_FURIF_Msk            (0x1UL << LTDC_ISR_FURIF_Pos) /*!< 0x00000100 */
#define LTDC_ISR_FURIF                LTDC_ISR_FURIF_Msk         /*!< FIFO underrun error at rotation interrupt flag */

