STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/* Bit fields for PWR_R6CIDCFGR register */
#define PWR_R6CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R6CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R6CIDCFGR_CFEN_Pos)
#define PWR_R6CIDCFGR_CFEN                     PWR_R6CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R6CIDCFGR_SCID_Pos                 (4U)
#define PWR_R6CIDCFGR_SCID_Msk                 (0x7UL << PWR_R6CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R6CIDCFGR_SCID                     PWR_R6CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

/* Bit fields for PWR_WIOSECCFGR register */
#define PWR_WIOSECCFGR_WIOSEC1_Pos             (0U)
#define PWR_WIOSECCFGR_WIOSEC1_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC1_Pos)
#define PWR_WIOSECCFGR_WIOSEC1                 PWR_WIOSECCFGR_WIOSEC1_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 1)These bits are written by software to enabled the secure mode for the wakeup IO x.- 0: The wakeup IO x is non-secure. Secure access is also possible.- 1: The wakeup IO x is secure only.This bit can only be written by secure application. If corresponding PRIVx bit is set in PWR_WIOPRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this Wakeup IO is enabled by setting CFEN bit in PWR_WIOxCIDCFGR, only an allowed compartment can write this bit, on top of secure and privileged restriction.Authorized compartment value depends on the value of SEM_EN bit in PWR_WIOxCIDCFGR and optionally the SEM_MUTEX bit in PWR_WIOxSEMCR. */
#define PWR_WIOSECCFGR_WIOSEC2_Pos             (1U)
#define PWR_WIOSECCFGR_WIOSEC2_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC2_Pos)
#define PWR_WIOSECCFGR_WIOSEC2                 PWR_WIOSECCFGR_WIOSEC2_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 2)See WIOSEC1 for details. */
#define PWR_WIOSECCFGR_WIOSEC3_Pos             (2U)
#define PWR_WIOSECCFGR_WIOSEC3_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC3_Pos)
#define PWR_WIOSECCFGR_WIOSEC3                 PWR_WIOSECCFGR_WIOSEC3_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 3)See WIOSEC1 for details. */
#define PWR_WIOSECCFGR_WIOSEC4_Pos             (3U)
#define PWR_WIOSECCFGR_WIOSEC4_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC4_Pos)
#define PWR_WIOSECCFGR_WIOSEC4                 PWR_WIOSECCFGR_WIOSEC4_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 4)See WIOSEC1 for details. */
#define PWR_WIOSECCFGR_WIOSEC5_Pos             (4U)
#define PWR_WIOSECCFGR_WIOSEC5_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC5_Pos)
#define PWR_WIOSECCFGR_WIOSEC5                 PWR_WIOSECCFGR_WIOSEC5_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 5)See WIOSEC1 for details. */
#define PWR_WIOSECCFGR_WIOSEC6_Pos             (5U)
#define PWR_WIOSECCFGR_WIOSEC6_Msk             (0x1UL << PWR_WIOSECCFGR_WIOSEC6_Pos)
#define PWR_WIOSECCFGR_WIOSEC6                 PWR_WIOSECCFGR_WIOSEC6_Msk  /*!< Secure attribute reference for the Wakeup IO x (x = 6)See WIOSEC1 for details. */

/* Bit fields for PWR_WIOPRIVCFGR register */
#define PWR_WIOPRIVCFGR_WIOPRIV1_Pos           (0U)
#define PWR_WIOPRIVCFGR_WIOPRIV1_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV1_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV1               PWR_WIOPRIVCFGR_WIOPRIV1_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 1)These bits are written by software to enabled the privileged mode for the Wakeup IO x.- 0: The Wakeup IO x is unprivileged. Privileged access is also possible.- 1: The Wakeup IO x is privileged only.This bit can only be written by privileged application. If corresponding SECx bit is set in PWR_WIOSECCFGR this bit can only be written by secure privileged application.If compartment filtering for this Wakeup IO is enabled by setting CFEN bit in PWR_WIOxCIDCFGR, only an allowed compartment can write this bit, on top of secure and privileged restriction.Authorized compartment value depends on the value of SEM_EN bit in PWR_WIOxCIDCFGR and optionally the SEM_MUTEX bit in PWR_WIOxSEMCR. */
#define PWR_WIOPRIVCFGR_WIOPRIV2_Pos           (1U)
#define PWR_WIOPRIVCFGR_WIOPRIV2_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV2_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV2               PWR_WIOPRIVCFGR_WIOPRIV2_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 2)See WIOPRIV1 for details. */
#define PWR_WIOPRIVCFGR_WIOPRIV3_Pos           (2U)
#define PWR_WIOPRIVCFGR_WIOPRIV3_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV3_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV3               PWR_WIOPRIVCFGR_WIOPRIV3_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 3)See WIOPRIV1 for details. */
#define PWR_WIOPRIVCFGR_WIOPRIV4_Pos           (3U)
#define PWR_WIOPRIVCFGR_WIOPRIV4_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV4_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV4               PWR_WIOPRIVCFGR_WIOPRIV4_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 4)See WIOPRIV1 for details. */
#define PWR_WIOPRIVCFGR_WIOPRIV5_Pos           (4U)
#define PWR_WIOPRIVCFGR_WIOPRIV5_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV5_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV5               PWR_WIOPRIVCFGR_WIOPRIV5_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 5)See WIOPRIV1 for details. */
#define PWR_WIOPRIVCFGR_WIOPRIV6_Pos           (5U)
#define PWR_WIOPRIVCFGR_WIOPRIV6_Msk           (0x1UL << PWR_WIOPRIVCFGR_WIOPRIV6_Pos)
#define PWR_WIOPRIVCFGR_WIOPRIV6               PWR_WIOPRIVCFGR_WIOPRIV6_Msk  /*!< Privileged attribute reference for the Wakeup IO x (x = 6)See WIOPRIV1 for details. */

/* Bit fields for PWR_WIO1CIDCFGR register */
#define PWR_WIO1CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO1CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO1CIDCFGR_CFEN_Pos)
#define PWR_WIO1CIDCFGR_CFEN                   PWR_WIO1CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO1CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO1CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO1CIDCFGR_SEM_EN_Pos)
#define PWR_WIO1CIDCFGR_SEM_EN                 PWR_WIO1CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO1CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO1CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO1CIDCFGR_SCID_Pos)
#define PWR_WIO1CIDCFGR_SCID                   PWR_WIO1CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO1CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO1CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC0                PWR_WIO1CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO1CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC1                PWR_WIO1CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO1CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC2                PWR_WIO1CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO1CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC3                PWR_WIO1CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO1CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC4                PWR_WIO1CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO1CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC5                PWR_WIO1CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO1CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC6                PWR_WIO1CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO1CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO1CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO1CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO1CIDCFGR_SEMWLC7                PWR_WIO1CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

