STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/* Bit fields for RCC_LSMCUDIVR register */
#define RCC_LSMCUDIVR_LSMCUDIV_Pos                   (0U)
#define RCC_LSMCUDIVR_LSMCUDIV_Msk                   (0x1UL << RCC_LSMCUDIVR_LSMCUDIV_Pos)                  /*!< 0x00000001 */
#define RCC_LSMCUDIVR_LSMCUDIV                       RCC_LSMCUDIVR_LSMCUDIV_Msk                            /*!< LSMCU clock divider */
#define RCC_LSMCUDIVR_LSMCUDIVRDY_Pos                (31U)
#define RCC_LSMCUDIVR_LSMCUDIVRDY_Msk                (0x1UL << RCC_LSMCUDIVR_LSMCUDIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_LSMCUDIVR_LSMCUDIVRDY                    RCC_LSMCUDIVR_LSMCUDIVRDY_Msk                         /*!< LSMCU clock divider status */

/* Bit fields for RCC_DDRCPCFGR register */
#define RCC_DDRCPCFGR_DDRCPRST_Pos                   (0U)
#define RCC_DDRCPCFGR_DDRCPRST_Msk                   (0x1UL << RCC_DDRCPCFGR_DDRCPRST_Pos)                  /*!< 0x00000001 */
#define RCC_DDRCPCFGR_DDRCPRST                       RCC_DDRCPCFGR_DDRCPRST_Msk                            /*!< DDRC AXI port reset */
#define RCC_DDRCPCFGR_DDRCPEN_Pos                    (1U)
#define RCC_DDRCPCFGR_DDRCPEN_Msk                    (0x1UL << RCC_DDRCPCFGR_DDRCPEN_Pos)                   /*!< 0x00000002 */
#define RCC_DDRCPCFGR_DDRCPEN                        RCC_DDRCPCFGR_DDRCPEN_Msk                             /*!< DDRC AXI port clock enable */
#define RCC_DDRCPCFGR_DDRCPLPEN_Pos                  (2U)
#define RCC_DDRCPCFGR_DDRCPLPEN_Msk                  (0x1UL << RCC_DDRCPCFGR_DDRCPLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_DDRCPCFGR_DDRCPLPEN                      RCC_DDRCPCFGR_DDRCPLPEN_Msk                           /*!< DDRC AXI port clock enable during CSleep */

/* Bit fields for RCC_DDRCAPBCFGR register */
#define RCC_DDRCAPBCFGR_DDRCAPBRST_Pos               (0U)
#define RCC_DDRCAPBCFGR_DDRCAPBRST_Msk               (0x1UL << RCC_DDRCAPBCFGR_DDRCAPBRST_Pos)              /*!< 0x00000001 */
#define RCC_DDRCAPBCFGR_DDRCAPBRST                   RCC_DDRCAPBCFGR_DDRCAPBRST_Msk                        /*!< DDRC APB reset */
#define RCC_DDRCAPBCFGR_DDRCAPBEN_Pos                (1U)
#define RCC_DDRCAPBCFGR_DDRCAPBEN_Msk                (0x1UL << RCC_DDRCAPBCFGR_DDRCAPBEN_Pos)               /*!< 0x00000002 */
#define RCC_DDRCAPBCFGR_DDRCAPBEN                    RCC_DDRCAPBCFGR_DDRCAPBEN_Msk                         /*!< DDRC APB clock enable */
#define RCC_DDRCAPBCFGR_DDRCAPBLPEN_Pos              (2U)
#define RCC_DDRCAPBCFGR_DDRCAPBLPEN_Msk              (0x1UL << RCC_DDRCAPBCFGR_DDRCAPBLPEN_Pos)             /*!< 0x00000004 */
#define RCC_DDRCAPBCFGR_DDRCAPBLPEN                  RCC_DDRCAPBCFGR_DDRCAPBLPEN_Msk                       /*!< DDRC APB clock enable during CSleep */

/* Bit fields for RCC_DDRPHYCAPBCFGR register */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST_Pos         (0U)
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST_Msk         (0x1UL << RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST_Pos)        /*!< 0x00000001 */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST             RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST_Msk                  /*!< DDRPHYC APB reset */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN_Pos          (1U)
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN_Msk          (0x1UL << RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN_Pos)         /*!< 0x00000002 */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN              RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN_Msk                   /*!< DDRPHYC APB clock enable */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN_Pos        (2U)
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN_Msk        (0x1UL << RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN_Pos)       /*!< 0x00000004 */
#define RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN            RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN_Msk                 /*!< DDRPHYC APB clock enable during CSleep */

/* Bit fields for RCC_DDRPHYCCFGR register */
#define RCC_DDRPHYCCFGR_DDRPHYCEN_Pos                (1U)
#define RCC_DDRPHYCCFGR_DDRPHYCEN_Msk                (0x1UL << RCC_DDRPHYCCFGR_DDRPHYCEN_Pos)               /*!< 0x00000002 */
#define RCC_DDRPHYCCFGR_DDRPHYCEN                    RCC_DDRPHYCCFGR_DDRPHYCEN_Msk                         /*!< DDRPHYC kernel clock enable */

/* Bit fields for RCC_DDRCFGR register */
#define RCC_DDRCFGR_DDRCFGRST_Pos                    (0U)
#define RCC_DDRCFGR_DDRCFGRST_Msk                    (0x1UL << RCC_DDRCFGR_DDRCFGRST_Pos)                   /*!< 0x00000001 */
#define RCC_DDRCFGR_DDRCFGRST                        RCC_DDRCFGR_DDRCFGRST_Msk                             /*!< DDR APB configuration reset */
#define RCC_DDRCFGR_DDRCFGEN_Pos                     (1U)
#define RCC_DDRCFGR_DDRCFGEN_Msk                     (0x1UL << RCC_DDRCFGR_DDRCFGEN_Pos)                    /*!< 0x00000002 */
#define RCC_DDRCFGR_DDRCFGEN                         RCC_DDRCFGR_DDRCFGEN_Msk                              /*!< DDR APB configuration clock enable */
#define RCC_DDRCFGR_DDRCFGLPEN_Pos                   (2U)
#define RCC_DDRCFGR_DDRCFGLPEN_Msk                   (0x1UL << RCC_DDRCFGR_DDRCFGLPEN_Pos)                  /*!< 0x00000004 */
#define RCC_DDRCFGR_DDRCFGLPEN                       RCC_DDRCFGR_DDRCFGLPEN_Msk                            /*!< DDR APB configuration clock enable during CSleep  */

/* Bit fields for RCC_DDRITFCFGR register */
#define RCC_DDRITFCFGR_DDRRST_Pos                    (0U)
#define RCC_DDRITFCFGR_DDRRST_Msk                    (0x1UL << RCC_DDRITFCFGR_DDRRST_Pos)                   /*!< 0x00000001 */
#define RCC_DDRITFCFGR_DDRRST                        RCC_DDRITFCFGR_DDRRST_Msk                             /*!< DDR core and PHY reset */
#define RCC_DDRITFCFGR_DDRCKMOD_Pos                  (4U)
#define RCC_DDRITFCFGR_DDRCKMOD_Msk                  (0x3UL << RCC_DDRITFCFGR_DDRCKMOD_Pos)                 /*!< 0x00000030 */
#define RCC_DDRITFCFGR_DDRCKMOD                      RCC_DDRITFCFGR_DDRCKMOD_Msk                           /*!< RCC mode for DDR clock control */
#define RCC_DDRITFCFGR_DDRSHR_Pos                    (8U)
#define RCC_DDRITFCFGR_DDRSHR_Msk                    (0x1UL << RCC_DDRITFCFGR_DDRSHR_Pos)                   /*!< 0x00000100 */
#define RCC_DDRITFCFGR_DDRSHR                        RCC_DDRITFCFGR_DDRSHR_Msk                             /*!< DDR peripheral mode */
#define RCC_DDRITFCFGR_DDRPHYDLP_Pos                 (16U)
#define RCC_DDRITFCFGR_DDRPHYDLP_Msk                 (0x1UL << RCC_DDRITFCFGR_DDRPHYDLP_Pos)                /*!< 0x00010000 */
#define RCC_DDRITFCFGR_DDRPHYDLP                     RCC_DDRITFCFGR_DDRPHYDLP_Msk                          /*!< DDRPHY deep low-power mode (LP2 or LP3) */

