STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253fxx_cm33.h
/*******************  Bits definition for RISC_SECCFGR2 register **************/
#define RISC_SECCFGR2_SEC64_Pos       (0U)
#define RISC_SECCFGR2_SEC64_Msk       (0x1UL << RISC_SECCFGR2_SEC64_Pos)         /*!< 0x00000001 */
#define RISC_SECCFGR2_SEC64           RISC_SECCFGR2_SEC64_Msk
#define RISC_SECCFGR2_SEC65_Pos       (1U)
#define RISC_SECCFGR2_SEC65_Msk       (0x1UL << RISC_SECCFGR2_SEC65_Pos)         /*!< 0x00000002 */
#define RISC_SECCFGR2_SEC65           RISC_SECCFGR2_SEC65_Msk
#define RISC_SECCFGR2_SEC66_Pos       (2U)
#define RISC_SECCFGR2_SEC66_Msk       (0x1UL << RISC_SECCFGR2_SEC66_Pos)         /*!< 0x00000004 */
#define RISC_SECCFGR2_SEC66           RISC_SECCFGR2_SEC66_Msk
#define RISC_SECCFGR2_SEC67_Pos       (3U)
#define RISC_SECCFGR2_SEC67_Msk       (0x1UL << RISC_SECCFGR2_SEC67_Pos)         /*!< 0x00000008 */
#define RISC_SECCFGR2_SEC67           RISC_SECCFGR2_SEC67_Msk
#define RISC_SECCFGR2_SEC68_Pos       (4U)
#define RISC_SECCFGR2_SEC68_Msk       (0x1UL << RISC_SECCFGR2_SEC68_Pos)         /*!< 0x00000010 */
#define RISC_SECCFGR2_SEC68           RISC_SECCFGR2_SEC68_Msk
#define RISC_SECCFGR2_SEC69_Pos       (5U)
#define RISC_SECCFGR2_SEC69_Msk       (0x1UL << RISC_SECCFGR2_SEC69_Pos)         /*!< 0x00000020 */
#define RISC_SECCFGR2_SEC69           RISC_SECCFGR2_SEC69_Msk
#define RISC_SECCFGR2_SEC70_Pos       (6U)
#define RISC_SECCFGR2_SEC70_Msk       (0x1UL << RISC_SECCFGR2_SEC70_Pos)         /*!< 0x00000040 */
#define RISC_SECCFGR2_SEC70           RISC_SECCFGR2_SEC70_Msk
#define RISC_SECCFGR2_SEC71_Pos       (7U)
#define RISC_SECCFGR2_SEC71_Msk       (0x1UL << RISC_SECCFGR2_SEC71_Pos)         /*!< 0x00000080 */
#define RISC_SECCFGR2_SEC71            RISC_SECCFGR2_SEC71_Msk
#define RISC_SECCFGR2_SEC72_Pos       (8U)
#define RISC_SECCFGR2_SEC72_Msk       (0x1UL << RISC_SECCFGR2_SEC72_Pos)         /*!< 0x00000100 */
#define RISC_SECCFGR2_SEC72           RISC_SECCFGR2_SEC72_Msk
#define RISC_SECCFGR2_SEC73_Pos       (9U)
#define RISC_SECCFGR2_SEC73_Msk       (0x1UL << RISC_SECCFGR2_SEC73_Pos)         /*!< 0x00000200 */
#define RISC_SECCFGR2_SEC73           RISC_SECCFGR2_SEC73_Msk
#define RISC_SECCFGR2_SEC74_Pos       (10U)
#define RISC_SECCFGR2_SEC74_Msk       (0x1UL << RISC_SECCFGR2_SEC74_Pos)         /*!< 0x00000400 */
#define RISC_SECCFGR2_SEC74           RISC_SECCFGR2_SEC74_Msk
#define RISC_SECCFGR2_SEC75_Pos       (11U)
#define RISC_SECCFGR2_SEC75_Msk       (0x1UL << RISC_SECCFGR2_SEC75_Pos)         /*!< 0x00000800 */
#define RISC_SECCFGR2_SEC75           RISC_SECCFGR2_SEC75_Msk
#define RISC_SECCFGR2_SEC76_Pos       (12U)
#define RISC_SECCFGR2_SEC76_Msk       (0x1UL << RISC_SECCFGR2_SEC76_Pos)         /*!< 0x00001000 */
#define RISC_SECCFGR2_SEC76           RISC_SECCFGR2_SEC76_Msk
#define RISC_SECCFGR2_SEC77_Pos       (13U)
#define RISC_SECCFGR2_SEC77_Msk       (0x1UL << RISC_SECCFGR2_SEC77_Pos)         /*!< 0x00002000 */
#define RISC_SECCFGR2_SEC77           RISC_SECCFGR2_SEC77_Msk
#define RISC_SECCFGR2_SEC78_Pos       (14U)
#define RISC_SECCFGR2_SEC78_Msk       (0x1UL << RISC_SECCFGR2_SEC78_Pos)         /*!< 0x00004000 */
#define RISC_SECCFGR2_SEC78           RISC_SECCFGR2_SEC78_Msk
#define RISC_SECCFGR2_SEC79_Pos       (15U)
#define RISC_SECCFGR2_SEC79_Msk       (0x1UL << RISC_SECCFGR2_SEC79_Pos)         /*!< 0x00008000 */
#define RISC_SECCFGR2_SEC79           RISC_SECCFGR2_SEC79_Msk
#define RISC_SECCFGR2_SEC80_Pos       (16U)
#define RISC_SECCFGR2_SEC80_Msk       (0x1UL << RISC_SECCFGR2_SEC80_Pos)         /*!< 0x00010000 */
#define RISC_SECCFGR2_SEC80           RISC_SECCFGR2_SEC80_Msk
#define RISC_SECCFGR2_SEC81_Pos       (17U)
#define RISC_SECCFGR2_SEC81_Msk       (0x1UL << RISC_SECCFGR2_SEC81_Pos)         /*!< 0x00020000 */
#define RISC_SECCFGR2_SEC81           RISC_SECCFGR2_SEC81_Msk
#define RISC_SECCFGR2_SEC82_Pos       (18U)
#define RISC_SECCFGR2_SEC82_Msk       (0x1UL << RISC_SECCFGR2_SEC82_Pos)         /*!< 0x00040000 */
#define RISC_SECCFGR2_SEC82           RISC_SECCFGR2_SEC82_Msk
#define RISC_SECCFGR2_SEC83_Pos       (19U)
#define RISC_SECCFGR2_SEC83_Msk       (0x1UL << RISC_SECCFGR2_SEC83_Pos)         /*!< 0x00080000 */
#define RISC_SECCFGR2_SEC83           RISC_SECCFGR2_SEC83_Msk
#define RISC_SECCFGR2_SEC84_Pos       (20U)
#define RISC_SECCFGR2_SEC84_Msk       (0x1UL << RISC_SECCFGR2_SEC84_Pos)         /*!< 0x00100000 */
#define RISC_SECCFGR2_SEC84           RISC_SECCFGR2_SEC84_Msk
#define RISC_SECCFGR2_SEC85_Pos       (21U)
#define RISC_SECCFGR2_SEC85_Msk       (0x1UL << RISC_SECCFGR2_SEC85_Pos)         /*!< 0x00200000 */
#define RISC_SECCFGR2_SEC85           RISC_SECCFGR2_SEC85_Msk
#define RISC_SECCFGR2_SEC86_Pos       (22U)
#define RISC_SECCFGR2_SEC86_Msk       (0x1UL << RISC_SECCFGR2_SEC86_Pos)         /*!< 0x00400000 */
#define RISC_SECCFGR2_SEC86           RISC_SECCFGR2_SEC86_Msk
#define RISC_SECCFGR2_SEC87_Pos       (23U)
#define RISC_SECCFGR2_SEC87_Msk       (0x1UL << RISC_SECCFGR2_SEC87_Pos)         /*!< 0x00800000 */
#define RISC_SECCFGR2_SEC87           RISC_SECCFGR2_SEC87_Msk
#define RISC_SECCFGR2_SEC88_Pos       (24U)
#define RISC_SECCFGR2_SEC88_Msk       (0x1UL << RISC_SECCFGR2_SEC88_Pos)         /*!< 0x01000000 */
#define RISC_SECCFGR2_SEC88           RISC_SECCFGR2_SEC88_Msk
#define RISC_SECCFGR2_SEC89_Pos       (25U)
#define RISC_SECCFGR2_SEC89_Msk       (0x1UL << RISC_SECCFGR2_SEC89_Pos)         /*!< 0x02000000 */
#define RISC_SECCFGR2_SEC89           RISC_SECCFGR2_SEC89_Msk
#define RISC_SECCFGR2_SEC90_Pos       (26U)
#define RISC_SECCFGR2_SEC90_Msk       (0x1UL << RISC_SECCFGR2_SEC90_Pos)         /*!< 0x04000000 */
#define RISC_SECCFGR2_SEC90           RISC_SECCFGR2_SEC90_Msk
#define RISC_SECCFGR2_SEC91_Pos       (27U)
#define RISC_SECCFGR2_SEC91_Msk       (0x1UL << RISC_SECCFGR2_SEC91_Pos)         /*!< 0x08000000 */
#define RISC_SECCFGR2_SEC91           RISC_SECCFGR2_SEC91_Msk
#define RISC_SECCFGR2_SEC92_Pos       (28U)
#define RISC_SECCFGR2_SEC92_Msk       (0x1UL << RISC_SECCFGR2_SEC92_Pos)         /*!< 0x10000000 */
#define RISC_SECCFGR2_SEC92           RISC_SECCFGR2_SEC92_Msk
#define RISC_SECCFGR2_SEC93_Pos       (29U)
#define RISC_SECCFGR2_SEC93_Msk       (0x1UL << RISC_SECCFGR2_SEC93_Pos)         /*!< 0x20000000 */
#define RISC_SECCFGR2_SEC93           RISC_SECCFGR2_SEC93_Msk
#define RISC_SECCFGR2_SEC94_Pos       (30U)
#define RISC_SECCFGR2_SEC94_Msk       (0x1UL << RISC_SECCFGR2_SEC94_Pos)         /*!< 0x40000000 */
#define RISC_SECCFGR2_SEC94           RISC_SECCFGR2_SEC94_Msk
#define RISC_SECCFGR2_SEC95_Pos       (31U)
#define RISC_SECCFGR2_SEC95_Msk       (0x1UL << RISC_SECCFGR2_SEC95_Pos)         /*!< 0x80000000 */
#define RISC_SECCFGR2_SEC95           RISC_SECCFGR2_SEC95_Msk

/*******************  Bits definition for RISC_SECCFGR3 register **************/
#define RISC_SECCFGR3_SEC96_Pos       (0U)
#define RISC_SECCFGR3_SEC96_Msk       (0x1UL << RISC_SECCFGR3_SEC96_Pos)         /*!< 0x00000001 */
#define RISC_SECCFGR3_SEC96           RISC_SECCFGR3_SEC96_Msk
#define RISC_SECCFGR3_SEC97_Pos       (1U)
#define RISC_SECCFGR3_SEC97_Msk       (0x1UL << RISC_SECCFGR3_SEC97_Pos)         /*!< 0x00000002 */
#define RISC_SECCFGR3_SEC97           RISC_SECCFGR3_SEC97_Msk
#define RISC_SECCFGR3_SEC98_Pos       (2U)
#define RISC_SECCFGR3_SEC98_Msk       (0x1UL << RISC_SECCFGR3_SEC98_Pos)         /*!< 0x00000004 */
#define RISC_SECCFGR3_SEC98           RISC_SECCFGR3_SEC98_Msk
#define RISC_SECCFGR3_SEC99_Pos       (3U)
#define RISC_SECCFGR3_SEC99_Msk       (0x1UL << RISC_SECCFGR3_SEC99_Pos)         /*!< 0x00000008 */
#define RISC_SECCFGR3_SEC99           RISC_SECCFGR3_SEC99_Msk
#define RISC_SECCFGR3_SEC100_Pos      (4U)
#define RISC_SECCFGR3_SEC100_Msk      (0x1UL << RISC_SECCFGR3_SEC100_Pos)        /*!< 0x00000010 */
#define RISC_SECCFGR3_SEC100          RISC_SECCFGR3_SEC100_Msk
#define RISC_SECCFGR3_SEC101_Pos      (5U)
#define RISC_SECCFGR3_SEC101_Msk      (0x1UL << RISC_SECCFGR3_SEC101_Pos)        /*!< 0x00000020 */
#define RISC_SECCFGR3_SEC101          RISC_SECCFGR3_SEC101_Msk
#define RISC_SECCFGR3_SEC102_Pos      (6U)
#define RISC_SECCFGR3_SEC102_Msk      (0x1UL << RISC_SECCFGR3_SEC102_Pos)        /*!< 0x00000040 */
#define RISC_SECCFGR3_SEC102          RISC_SECCFGR3_SEC102_Msk
#define RISC_SECCFGR3_SEC103_Pos      (7U)
#define RISC_SECCFGR3_SEC103_Msk      (0x1UL << RISC_SECCFGR3_SEC103_Pos)        /*!< 0x00000080 */
#define RISC_SECCFGR3_SEC103          RISC_SECCFGR3_SEC103_Msk
#define RISC_SECCFGR3_SEC104_Pos      (8U)
#define RISC_SECCFGR3_SEC104_Msk      (0x1UL << RISC_SECCFGR3_SEC104_Pos)        /*!< 0x00000100 */
#define RISC_SECCFGR3_SEC104          RISC_SECCFGR3_SEC104_Msk
#define RISC_SECCFGR3_SEC105_Pos      (9U)
#define RISC_SECCFGR3_SEC105_Msk      (0x1UL << RISC_SECCFGR3_SEC105_Pos)        /*!< 0x00000200 */
#define RISC_SECCFGR3_SEC105          RISC_SECCFGR3_SEC105_Msk
#define RISC_SECCFGR3_SEC106_Pos      (10U)
#define RISC_SECCFGR3_SEC106_Msk      (0x1UL << RISC_SECCFGR3_SEC106_Pos)        /*!< 0x00000400 */
#define RISC_SECCFGR3_SEC106          RISC_SECCFGR3_SEC106_Msk
#define RISC_SECCFGR3_SEC107_Pos      (11U)
#define RISC_SECCFGR3_SEC107_Msk      (0x1UL << RISC_SECCFGR3_SEC107_Pos)        /*!< 0x00000800 */
#define RISC_SECCFGR3_SEC107          RISC_SECCFGR3_SEC107_Msk
#define RISC_SECCFGR3_SEC108_Pos      (12U)
#define RISC_SECCFGR3_SEC108_Msk      (0x1UL << RISC_SECCFGR3_SEC108_Pos)        /*!< 0x00001000 */
#define RISC_SECCFGR3_SEC108          RISC_SECCFGR3_SEC108_Msk
#define RISC_SECCFGR3_SEC109_Pos      (13U)
#define RISC_SECCFGR3_SEC109_Msk      (0x1UL << RISC_SECCFGR3_SEC109_Pos)        /*!< 0x00002000 */
#define RISC_SECCFGR3_SEC109          RISC_SECCFGR3_SEC109_Msk
#define RISC_SECCFGR3_SEC110_Pos      (14U)
#define RISC_SECCFGR3_SEC110_Msk      (0x1UL << RISC_SECCFGR3_SEC110_Pos)        /*!< 0x00004000 */
#define RISC_SECCFGR3_SEC110          RISC_SECCFGR3_SEC110_Msk
#define RISC_SECCFGR3_SEC111_Pos      (15U)
#define RISC_SECCFGR3_SEC111_Msk      (0x1UL << RISC_SECCFGR3_SEC111_Pos)        /*!< 0x00008000 */
#define RISC_SECCFGR3_SEC111          RISC_SECCFGR3_SEC111_Msk
#define RISC_SECCFGR3_SEC112_Pos      (16U)
#define RISC_SECCFGR3_SEC112_Msk      (0x1UL << RISC_SECCFGR3_SEC112_Pos)        /*!< 0x00010000 */
#define RISC_SECCFGR3_SEC112          RISC_SECCFGR3_SEC112_Msk
#define RISC_SECCFGR3_SEC113_Pos      (17U)
#define RISC_SECCFGR3_SEC113_Msk      (0x1UL << RISC_SECCFGR3_SEC113_Pos)        /*!< 0x00020000 */
#define RISC_SECCFGR3_SEC113          RISC_SECCFGR3_SEC113_Msk
#define RISC_SECCFGR3_SEC114_Pos      (18U)
#define RISC_SECCFGR3_SEC114_Msk      (0x1UL << RISC_SECCFGR3_SEC114_Pos)        /*!< 0x00040000 */
#define RISC_SECCFGR3_SEC114          RISC_SECCFGR3_SEC114_Msk
#define RISC_SECCFGR3_SEC115_Pos      (19U)
#define RISC_SECCFGR3_SEC115_Msk      (0x1UL << RISC_SECCFGR3_SEC115_Pos)        /*!< 0x00080000 */
#define RISC_SECCFGR3_SEC115          RISC_SECCFGR3_SEC115_Msk
#define RISC_SECCFGR3_SEC116_Pos      (20U)
#define RISC_SECCFGR3_SEC116_Msk      (0x1UL << RISC_SECCFGR3_SEC116_Pos)        /*!< 0x00100000 */
#define RISC_SECCFGR3_SEC116          RISC_SECCFGR3_SEC116_Msk
#define RISC_SECCFGR3_SEC117_Pos      (21U)
#define RISC_SECCFGR3_SEC117_Msk      (0x1UL << RISC_SECCFGR3_SEC117_Pos)        /*!< 0x00200000 */
#define RISC_SECCFGR3_SEC117          RISC_SECCFGR3_SEC117_Msk
#define RISC_SECCFGR3_SEC118_Pos      (22U)
#define RISC_SECCFGR3_SEC118_Msk      (0x1UL << RISC_SECCFGR3_SEC118_Pos)        /*!< 0x00400000 */
#define RISC_SECCFGR3_SEC118          RISC_SECCFGR3_SEC118_Msk
#define RISC_SECCFGR3_SEC119_Pos      (23U)
#define RISC_SECCFGR3_SEC119_Msk      (0x1UL << RISC_SECCFGR3_SEC119_Pos)        /*!< 0x00800000 */
#define RISC_SECCFGR3_SEC119          RISC_SECCFGR3_SEC119_Msk
#define RISC_SECCFGR3_SEC120_Pos      (24U)
#define RISC_SECCFGR3_SEC120_Msk      (0x1UL << RISC_SECCFGR3_SEC120_Pos)        /*!< 0x01000000 */
#define RISC_SECCFGR3_SEC120          RISC_SECCFGR3_SEC120_Msk
#define RISC_SECCFGR3_SEC121_Pos      (25U)
#define RISC_SECCFGR3_SEC121_Msk      (0x1UL << RISC_SECCFGR3_SEC121_Pos)        /*!< 0x02000000 */
#define RISC_SECCFGR3_SEC121          RISC_SECCFGR3_SEC121_Msk
#define RISC_SECCFGR3_SEC122_Pos      (26U)
#define RISC_SECCFGR3_SEC122_Msk      (0x1UL << RISC_SECCFGR3_SEC122_Pos)        /*!< 0x04000000 */
#define RISC_SECCFGR3_SEC122          RISC_SECCFGR3_SEC122_Msk
#define RISC_SECCFGR3_SEC123_Pos      (27U)
#define RISC_SECCFGR3_SEC123_Msk      (0x1UL << RISC_SECCFGR3_SEC123_Pos)        /*!< 0x08000000 */
#define RISC_SECCFGR3_SEC123          RISC_SECCFGR3_SEC123_Msk
#define RISC_SECCFGR3_SEC124_Pos      (28U)
#define RISC_SECCFGR3_SEC124_Msk      (0x1UL << RISC_SECCFGR3_SEC124_Pos)        /*!< 0x10000000 */
#define RISC_SECCFGR3_SEC124          RISC_SECCFGR3_SEC124_Msk
#define RISC_SECCFGR3_SEC125_Pos      (29U)
#define RISC_SECCFGR3_SEC125_Msk      (0x1UL << RISC_SECCFGR3_SEC125_Pos)        /*!< 0x20000000 */
#define RISC_SECCFGR3_SEC125          RISC_SECCFGR3_SEC125_Msk
#define RISC_SECCFGR3_SEC126_Pos      (30U)
#define RISC_SECCFGR3_SEC126_Msk      (0x1UL << RISC_SECCFGR3_SEC126_Pos)        /*!< 0x40000000 */
#define RISC_SECCFGR3_SEC126          RISC_SECCFGR3_SEC126_Msk
#define RISC_SECCFGR3_SEC127_Pos      (31U)
#define RISC_SECCFGR3_SEC127_Msk      (0x1UL << RISC_SECCFGR3_SEC127_Pos)        /*!< 0x80000000 */
#define RISC_SECCFGR3_SEC127          RISC_SECCFGR3_SEC127_Msk

/*******************  Bits definition for RISC_SECCFGR4 register **************/
#define RISC_SECCFGR4_SEC128_Pos      (0U)
#define RISC_SECCFGR4_SEC128_Msk      (0x1UL << RISC_SECCFGR4_SEC128_Pos)        /*!< 0x00000001 */
#define RISC_SECCFGR4_SEC128          RISC_SECCFGR4_SEC128_Msk
#define RISC_SECCFGR4_SEC129_Pos      (1U)
#define RISC_SECCFGR4_SEC129_Msk      (0x1UL << RISC_SECCFGR4_SEC129_Pos)        /*!< 0x00000002 */
#define RISC_SECCFGR4_SEC129          RISC_SECCFGR4_SEC129_Msk
#define RISC_SECCFGR4_SEC130_Pos      (2U)
#define RISC_SECCFGR4_SEC130_Msk      (0x1UL << RISC_SECCFGR4_SEC130_Pos)        /*!< 0x00000004 */
#define RISC_SECCFGR4_SEC130          RISC_SECCFGR4_SEC130_Msk
#define RISC_SECCFGR4_SEC131_Pos      (3U)
#define RISC_SECCFGR4_SEC131_Msk      (0x1UL << RISC_SECCFGR4_SEC131_Pos)        /*!< 0x00000008 */
#define RISC_SECCFGR4_SEC131          RISC_SECCFGR4_SEC131_Msk
#define RISC_SECCFGR4_SEC132_Pos      (4U)
#define RISC_SECCFGR4_SEC132_Msk      (0x1UL << RISC_SECCFGR4_SEC132_Pos)        /*!< 0x00000010 */
#define RISC_SECCFGR4_SEC132          RISC_SECCFGR4_SEC132_Msk
#define RISC_SECCFGR4_SEC133_Pos      (5U)
#define RISC_SECCFGR4_SEC133_Msk      (0x1UL << RISC_SECCFGR4_SEC133_Pos)        /*!< 0x00000020 */
#define RISC_SECCFGR4_SEC133          RISC_SECCFGR4_SEC133_Msk
#define RISC_SECCFGR4_SEC134_Pos      (6U)
#define RISC_SECCFGR4_SEC134_Msk      (0x1UL << RISC_SECCFGR4_SEC134_Pos)        /*!< 0x00000040 */
#define RISC_SECCFGR4_SEC134          RISC_SECCFGR4_SEC134_Msk
#define RISC_SECCFGR4_SEC135_Pos      (7U)
#define RISC_SECCFGR4_SEC135_Msk      (0x1UL << RISC_SECCFGR4_SEC135_Pos)        /*!< 0x00000080 */
#define RISC_SECCFGR4_SEC135          RISC_SECCFGR4_SEC135_Msk
#define RISC_SECCFGR4_SEC136_Pos      (8U)
#define RISC_SECCFGR4_SEC136_Msk      (0x1UL << RISC_SECCFGR4_SEC136_Pos)        /*!< 0x00000100 */
#define RISC_SECCFGR4_SEC136          RISC_SECCFGR4_SEC136_Msk
#define RISC_SECCFGR4_SEC137_Pos      (9U)
#define RISC_SECCFGR4_SEC137_Msk      (0x1UL << RISC_SECCFGR4_SEC137_Pos)        /*!< 0x00000200 */
#define RISC_SECCFGR4_SEC137          RISC_SECCFGR4_SEC137_Msk
#define RISC_SECCFGR4_SEC138_Pos      (10U)
#define RISC_SECCFGR4_SEC138_Msk      (0x1UL << RISC_SECCFGR4_SEC138_Pos)        /*!< 0x00000400 */
#define RISC_SECCFGR4_SEC138          RISC_SECCFGR4_SEC138_Msk
#define RISC_SECCFGR4_SEC139_Pos      (11U)
#define RISC_SECCFGR4_SEC139_Msk      (0x1UL << RISC_SECCFGR4_SEC139_Pos)        /*!< 0x00000800 */
#define RISC_SECCFGR4_SEC139          RISC_SECCFGR4_SEC139_Msk
#define RISC_SECCFGR4_SEC140_Pos      (12U)
#define RISC_SECCFGR4_SEC140_Msk      (0x1UL << RISC_SECCFGR4_SEC140_Pos)        /*!< 0x00001000 */
#define RISC_SECCFGR4_SEC140          RISC_SECCFGR4_SEC140_Msk
#define RISC_SECCFGR4_SEC141_Pos      (13U)
#define RISC_SECCFGR4_SEC141_Msk      (0x1UL << RISC_SECCFGR4_SEC141_Pos)        /*!< 0x00002000 */
#define RISC_SECCFGR4_SEC141          RISC_SECCFGR4_SEC141_Msk
#define RISC_SECCFGR4_SEC142_Pos      (14U)
#define RISC_SECCFGR4_SEC142_Msk      (0x1UL << RISC_SECCFGR4_SEC142_Pos)        /*!< 0x00004000 */
#define RISC_SECCFGR4_SEC142          RISC_SECCFGR4_SEC142_Msk
#define RISC_SECCFGR4_SEC143_Pos      (15U)
#define RISC_SECCFGR4_SEC143_Msk      (0x1UL << RISC_SECCFGR4_SEC143_Pos)        /*!< 0x00008000 */
#define RISC_SECCFGR4_SEC143          RISC_SECCFGR4_SEC143_Msk
#define RISC_SECCFGR4_SEC144_Pos      (16U)
#define RISC_SECCFGR4_SEC144_Msk      (0x1UL << RISC_SECCFGR4_SEC144_Pos)        /*!< 0x00010000 */
#define RISC_SECCFGR4_SEC144          RISC_SECCFGR4_SEC144_Msk
#define RISC_SECCFGR4_SEC145_Pos      (17U)
#define RISC_SECCFGR4_SEC145_Msk      (0x1UL << RISC_SECCFGR4_SEC145_Pos)        /*!< 0x00020000 */
#define RISC_SECCFGR4_SEC145          RISC_SECCFGR4_SEC145_Msk
#define RISC_SECCFGR4_SEC146_Pos      (18U)
#define RISC_SECCFGR4_SEC146_Msk      (0x1UL << RISC_SECCFGR4_SEC146_Pos)        /*!< 0x00040000 */
#define RISC_SECCFGR4_SEC146          RISC_SECCFGR4_SEC146_Msk
#define RISC_SECCFGR4_SEC147_Pos      (19U)
#define RISC_SECCFGR4_SEC147_Msk      (0x1UL << RISC_SECCFGR4_SEC147_Pos)        /*!< 0x00080000 */
#define RISC_SECCFGR4_SEC147          RISC_SECCFGR4_SEC147_Msk
#define RISC_SECCFGR4_SEC148_Pos      (20U)
#define RISC_SECCFGR4_SEC148_Msk      (0x1UL << RISC_SECCFGR4_SEC148_Pos)        /*!< 0x00100000 */
#define RISC_SECCFGR4_SEC148          RISC_SECCFGR4_SEC148_Msk
#define RISC_SECCFGR4_SEC149_Pos      (21U)
#define RISC_SECCFGR4_SEC149_Msk      (0x1UL << RISC_SECCFGR4_SEC149_Pos)        /*!< 0x00200000 */
#define RISC_SECCFGR4_SEC149          RISC_SECCFGR4_SEC149_Msk
#define RISC_SECCFGR4_SEC150_Pos      (22U)
#define RISC_SECCFGR4_SEC150_Msk      (0x1UL << RISC_SECCFGR4_SEC150_Pos)        /*!< 0x00400000 */
#define RISC_SECCFGR4_SEC150          RISC_SECCFGR4_SEC150_Msk
#define RISC_SECCFGR4_SEC151_Pos      (23U)
#define RISC_SECCFGR4_SEC151_Msk      (0x1UL << RISC_SECCFGR4_SEC151_Pos)        /*!< 0x00800000 */
#define RISC_SECCFGR4_SEC151          RISC_SECCFGR4_SEC151_Msk
#define RISC_SECCFGR4_SEC152_Pos      (24U)
#define RISC_SECCFGR4_SEC152_Msk      (0x1UL << RISC_SECCFGR4_SEC152_Pos)        /*!< 0x01000000 */
#define RISC_SECCFGR4_SEC152          RISC_SECCFGR4_SEC152_Msk
#define RISC_SECCFGR4_SEC153_Pos      (25U)
#define RISC_SECCFGR4_SEC153_Msk      (0x1UL << RISC_SECCFGR4_SEC153_Pos)        /*!< 0x02000000 */
#define RISC_SECCFGR4_SEC153          RISC_SECCFGR4_SEC153_Msk
#define RISC_SECCFGR4_SEC154_Pos      (26U)
#define RISC_SECCFGR4_SEC154_Msk      (0x1UL << RISC_SECCFGR4_SEC154_Pos)        /*!< 0x04000000 */
#define RISC_SECCFGR4_SEC154          RISC_SECCFGR4_SEC154_Msk
#define RISC_SECCFGR4_SEC155_Pos      (27U)
#define RISC_SECCFGR4_SEC155_Msk      (0x1UL << RISC_SECCFGR4_SEC155_Pos)        /*!< 0x08000000 */
#define RISC_SECCFGR4_SEC155          RISC_SECCFGR4_SEC155_Msk
#define RISC_SECCFGR4_SEC156_Pos      (28U)
#define RISC_SECCFGR4_SEC156_Msk      (0x1UL << RISC_SECCFGR4_SEC156_Pos)        /*!< 0x10000000 */
#define RISC_SECCFGR4_SEC156          RISC_SECCFGR4_SEC156_Msk
#define RISC_SECCFGR4_SEC157_Pos      (29U)
#define RISC_SECCFGR4_SEC157_Msk      (0x1UL << RISC_SECCFGR4_SEC157_Pos)        /*!< 0x20000000 */
#define RISC_SECCFGR4_SEC157          RISC_SECCFGR4_SEC157_Msk
#define RISC_SECCFGR4_SEC158_Pos      (30U)
#define RISC_SECCFGR4_SEC158_Msk      (0x1UL << RISC_SECCFGR4_SEC158_Pos)        /*!< 0x40000000 */
#define RISC_SECCFGR4_SEC158          RISC_SECCFGR4_SEC158_Msk
#define RISC_SECCFGR4_SEC159_Pos      (31U)
#define RISC_SECCFGR4_SEC159_Msk      (0x1UL << RISC_SECCFGR4_SEC159_Pos)        /*!< 0x80000000 */
#define RISC_SECCFGR4_SEC159          RISC_SECCFGR4_SEC159_Msk

